SM_для_EDT/src/Catalogs/рарусВидыМероприятийСУБ/рарусВидыМероприятийСУБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рарусВидыМероприятийСУБ</name>
  <attributes>
    <name>ТипМероприятия</name>
    <type>
      <types>EnumRef.рарусТипыМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Обозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектМероприятия</name>
    <type>
      <types>EnumRef.рарусВидыВладельцевДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОсвидетельствования</name>
    <type>
      <types>CatalogRef.рарусТипыОсвидетельствования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.рарусВидыДокументовОсвидетельствования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <types>CatalogRef.vftПодразделенияКомпании</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодическоеМероприятие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетРезультатВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОпроса</name>
    <type>
      <types>CatalogRef.ШаблоныАнкет</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролирующийОрган</name>
    <type>
      <types>CatalogRef.рарусКонтролирующиеОрганы</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерМероприятия</name>
    <type>
      <types>EnumRef.рарусХарактерМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяКодыЗамечанийИСроковУстранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Конвенция</name>
    <type>
      <types>CatalogRef.рарусКонвенции</types>
    </type>
  </attributes>
</mdclass:Catalog>

SM_для_EDT/src/Enums/рарусТипыМероприятия/рарусТипыМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусТипыМероприятия</name>
  <enumValues>
    <name>ОсвидетельствованиеСудна</name>
  </enumValues>
  <enumValues>
    <name>ОсвидетельствованиеКомпании</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийАудит</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннийАудит</name>
  </enumValues>
  <enumValues>
    <name>Учение</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Catalogs/рарусВидыМероприятийСУБ/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	НастроитьДоступностьРеквизитовФормы(ЭтотОбъект);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);

	//СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	//Конец СтандартныеПодсистемы.РаботаСФайлами
						
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	СобытияФорм.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);

КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда) Экспорт
	
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды() Экспорт
	
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
    ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ПриИзмененииРеквизитов

&НаКлиенте
Процедура ВидМероприятияПриИзменении(Элемент)
	
	НастроитьДоступностьРеквизитовФормы(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПериодическоеМероприятиеПриИзменении(Элемент)
	
	НастроитьДоступностьРеквизитовФормы(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ТипМероприятияПриИзменении(Элемент)
	
	НастроитьДоступностьРеквизитовФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьДоступностьРеквизитовФормы(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
		
	ВнешнееМероприятие = Объект.ТипМероприятия = ПредопределенноеЗначение("Перечисление.рарусТипыМероприятия.ОсвидетельствованиеКомпании")
	                           Или Объект.ТипМероприятия = ПредопределенноеЗначение("Перечисление.рарусТипыМероприятия.ОсвидетельствованиеСудна");	
	
	ВнутренееМероприятие  = Объект.ТипМероприятия = ПредопределенноеЗначение("Перечисление.рарусТипыМероприятия.ВнутреннийАудит")
	                                     Или Объект.ТипМероприятия = ПредопределенноеЗначение("Перечисление.рарусТипыМероприятия.Учение");	
	
	Элементы.ОбъектМероприятия.ТолькоПросмотр = ВнешнееМероприятие;										  
	Элементы.ПериодическоеМероприятие.Видимость = Не ВнешнееМероприятие;					  	
	Элементы.ТипОсвидетельствования.Видимость = ВнешнееМероприятие;
	Элементы.ГруппаПериод.Видимость = Объект.ПериодическоеМероприятие;
	// Временно уберем видимость
	//Элементы.Подразделение.Видимость = ВнутренееМероприятие;
	 Элементы.Подразделение.Видимость = Ложь;
    //
	Элементы.КонтролирующийОрган.Видимость = ВнешнееМероприятие 
	                     Или Объект.ТипМероприятия = ПредопределенноеЗначение("Перечисление.рарусТипыМероприятия.ВнешнийАудит");
	
	Учение = Объект.ТипМероприятия = ПредопределенноеЗначение("Перечисление.рарусТипыМероприятия.Учение");
	Элементы.ШаблонОпроса.Видимость = Не Учение;
	Элементы.ВидДокумента.Видимость = Не Учение;
	Элементы.ИмеетРезультатВыполнения.Видимость = Не Учение;
	Элементы.Конвенция.Видимость =  Не Учение;
	
КонецПроцедуры
								  
#КонецОбласти
